Documents/НачислениеРезервовПИФ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>НачислениеРезервовПИФ</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РезервыПИФ</xr:Item>
				<xr:Item>AccountingRegister.БухгалтерскийУчет</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПаевойИнвестиционныйФонд</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПаевыеИнвестиционныеФонды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоДней</Name>
					<Comment>Не используется</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЧистыхАктивов</Name>
					<Comment>Не используется</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНаВознаграждениеУправляющего</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНаУслугиДепозитария</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНаПрочиеРасходы</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/НачислениеРезервовПИФ/Ext/ObjectModule.bsl
Процедура ПроведениеПоРегистрамБэкОфиса(Отказ) Экспорт
	
	РаботаСРегистрамиНакопления.ОчиститьДвиженияПоБэкофису(ЭтотОбъект);
	
	Движения.РезервыПИФ.Записывать = Истина;

	УсловияПравилПИФ = БухгалтерскийУчет.ОпределитьУсловияПравилПаевогоИнвестиционногоФонда(НачалоДня(Дата), ПаевойИнвестиционныйФонд);
	Если СуммаНаВознаграждениеУправляющего <> 0 И УсловияПравилПИФ.НачислятьРезервыЗаВознаграждениеУправляющегоВБэкОфисе Тогда
	    ДобавитьДвижениеПоРезервам(СуммаНаВознаграждениеУправляющего, Справочники.Резервы.ВознаграждениеУправляющего);
	КонецЕсли;
	
	Если СуммаНаУслугиДепозитария <> 0 И УсловияПравилПИФ.НачислятьРезервыЗаВознаграждениеДепозитарияВБэкОфисе Тогда
	    ДобавитьДвижениеПоРезервам(СуммаНаУслугиДепозитария, Справочники.Резервы.ВознаграждениеДепозитарияАудитораОценщика);
	КонецЕсли;
	
	Если СуммаНаПрочиеРасходы <> 0 И УсловияПравилПИФ.НачислятьРезервыЗаПрочиеВозмещаемыеРасходыУправляющегоВБэкОфисе Тогда
	    ДобавитьДвижениеПоРезервам(СуммаНаПрочиеРасходы, Справочники.Резервы.ПрочиеВозмещаемыеРасходыУправляющего);
	КонецЕсли;	
		
КонецПроцедуры // ПроведениеПоРегистрамБэкОфиса

Процедура ДобавитьДвижениеПоРезервам(Сумма, Резерв)
	
	Движение = Движения.РезервыПИФ.ДобавитьПриход();
	
	Движение.Период      = Дата;
	Движение.Организация = Организация;
	Движение.СчетДоверительногоУправления = СчетДоверительногоУправления;
	Движение.Резерв = Резерв;
	Движение.Валюта = Организация.ВалютаУчета;
	Движение.Сумма  = Сумма;

КонецПроцедуры

Процедура ПроведениеПоРегиструБухгалтерии(УчетныйРегистр, Отказ) Экспорт

	Движения[УчетныйРегистр].Записывать = Истина;
	
	ЭтоОтчетнаяДатаСЧА = Справочники.НастройкиРегламентныхДействий.ПолучитьДатуПоследнегоРасчетаСЧАЗаПериод(ЭтотОбъект.СчетДоверительногоУправления, ЭтотОбъект.Дата, ЭтотОбъект.Дата);
	
	Если ЭтоОтчетнаяДатаСЧА = Неопределено Тогда
		Возврат; //движение по резерву - только в отчетную дату
	Иначе
		
		ПредыдущаяДатаСЧА = Справочники.НастройкиРегламентныхДействий.ПолучитьДатуПредыдущегоРасчетаСЧА(ЭтотОбъект.СчетДоверительногоУправления, ЭтотОбъект.Дата);
		Если ПредыдущаяДатаСЧА = Неопределено Тогда
			ПредыдущаяДатаСЧА = НачалоДня(ЭтотОбъект.Дата)-1;//первый раз начисляем резервы по ПИФ
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	РезервыПИФ.Резерв КАК Резерв,
			|	РезервыПИФ.Валюта КАК Валюта,
			|	СУММА(РезервыПИФ.Сумма) КАК Сумма
			|ИЗ
			|	РегистрНакопления.РезервыПИФ КАК РезервыПИФ
			|ГДЕ
			|	РезервыПИФ.Организация = &Организация
			|	И РезервыПИФ.СчетДоверительногоУправления = &СчетДоверительногоУправления
			|	И РезервыПИФ.Период МЕЖДУ &ПредыдущаяДатаСЧА И &ТекущаяДатаСЧА
			|	И РезервыПИФ.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
			|
			|СГРУППИРОВАТЬ ПО
			|	РезервыПИФ.Резерв,
			|	РезервыПИФ.Валюта";
		
		Запрос.УстановитьПараметр("Организация", Организация);
		Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправления);
		Запрос.УстановитьПараметр("ПредыдущаяДатаСЧА", КонецДня(ПредыдущаяДатаСЧА)+1);
		Запрос.УстановитьПараметр("ТекущаяДатаСЧА", КонецДня(ЭтотОбъект.Дата));
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			// Формирование проводок по бухгалтерскому учету связано с настройкам учета резервов
			Если Справочники.СчетаДоверительногоУправления.НачислятьРезервыПредстоящихРасходов(ЭтотОбъект.СчетДоверительногоУправления, ЭтотОбъект.Дата, ВыборкаДетальныеЗаписи.Резерв) Тогда
			    ДобавитьПроводкуПоРезерву(УчетныйРегистр, ВыборкаДетальныеЗаписи.Сумма, ВыборкаДетальныеЗаписи.Резерв);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
		
КонецПроцедуры // ПроведениеПоРегиструБухгалтерии

Процедура ДобавитьПроводкуПоРезерву(УчетныйРегистр, Сумма, Резерв)
	
	Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения[УчетныйРегистр], Сумма, "Начисление резервов");
	
	Проводка.СчетДт = ПланыСчетов.Основной.ПрочееЦелевоеФинансированиеИПоступления;
		
	Проводка.СчетКт = ПланыСчетов.Основной.РезервыПредстоящихРасходов;
	Проводка.СубконтоКт.Резервы = Резерв;
	
КонецПроцедуры

#Область ОБРАБОТЧИКИ_СОБЫТИЙ

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект, ДанныеЗаполнения);
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		
		ДанныеЗаполнения.Свойство("ПаевойИнвестиционныйФонд", ПаевойИнвестиционныйФонд);
		
		СчетДоверительногоУправления = Справочники.СчетаДоверительногоУправления.СчетДоверительногоУправленияКлиента(
						ПаевойИнвестиционныйФонд, ?(ЗначениеЗаполнено(Дата), Дата, ТекущаяДата()));
		
	КонецЕсли;
		
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
		
	УниверсальныеМеханизмы.ПослеОбработкиПроверкиЗаполнения(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если Не Отказ Тогда
		РаботаСЖурналамиОпераций.ПриЗаписиДокумента(ЭтотОбъект);
	КонецЕсли; 
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	РаботаСДокументами.СформироватьДвиженияПоРегистрамБэкОфиса(ЭтотОбъект, Отказ);
	
	РаботаСДокументами.СформироватьПроводки(ЭтотОбъект, Отказ);
		
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// предварительная обработка объекта
	РаботаСДокументами.ПередЗаписью(ЭтотОбъект);

	// блокирующие проверки
	Если Не УниверсальныеМеханизмы.ОбъектМожноЗаписать(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;	
	
	ЭтоПроведениеПоБухУчету = ДополнительныеСвойства.Свойство("ВидыУчетаДляПроведения") И ДополнительныеСвойства.ВидыУчетаДляПроведения.Количество() > 0;
	
	Если Не (ДополнительныеСвойства.Свойство("ЗаписьВСоставеРегистрацииСтоимостиАктивов") Или ДополнительныеСвойства.Свойство("НумерацияДокументов") Или ДополнительныеСвойства.Свойство("ГрупповоеПроведение") Или ЭтоПроведениеПоБухУчету) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Изменение документа доступно только из регистрации стоимости активов", ЭтотОбъект,,, Отказ);
		Возврат;
	КонецЕсли; 
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		ДатаНачалаУчетаРезервовПИФ = СистемныеФункции.ПолучитьДатуНачалаУчетаРезервовПИФ();
		
		Если ЭтотОбъект.Дата < ДатаНачалаУчетаРезервовПИФ Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Запрещен учет резервов ПИФ" + ?(ЗначениеЗаполнено(ДатаНачалаУчетаРезервовПИФ), " до " + Формат(ДатаНачалаУчетаРезервовПИФ, "ДЛФ=DD"), ""), ЭтотОбъект,,, Отказ);
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
